      ******************************************************************
      * Author:
      * Date:
      * Purpose:
      * Tectonics: cobc
      ******************************************************************
       IDENTIFICATION DIVISION.
      *-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-
       PROGRAM-ID. EMPLEADOS.
       ENVIRONMENT DIVISION.
      *-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-
       CONFIGURATION SECTION.
      *-----------------------
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
       SELECT ARCHIVO-EMPLEADOS
       ASSIGN TO "empleados.txt"
       ORGANIZATION INDEXED
       ACCESS MODE DYNAMIC
       RECORD KEY IS REG-NUMERO-EMPLEADO
       FILE STATUS FS-STATUS.


       DATA DIVISION.
      *-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-
       FILE SECTION.
       FD ARCHIVO-EMPLEADOS.
       01 REGISTRO-EMPLEADOS.
           05 REG-NUMERO-EMPLEADO PIC 9(8).
           05 REG-NOMBRE-EMPLEADO PIC X(60).
           05 REG-EDAD PIC 9(2).
           05 REG-SEXO PIC X(1).
           05 REG-DOMICILIO PIC X(30).
           05 REG-TELEFONO PIC 9(10).
           05 REG-RFC PIC X(13).
           05 REG-NSS PIC 9(11).
           05 REG-SIN-USO PIC X(100).

       WORKING-STORAGE SECTION.
       01 OPCION PIC X(1).
       01 ENTRADA-EMPLEADO PIC X(241).
       01 OPCION-MOD PIC X(1).
       01 CONFIRMACION-ELIMINAR PIC X(1).

       01 WKS-EMPLEADO.
           05 WKS-NUM-EMP PIC 9(8).
           05 WKS-NOMBRE-COMP.
               10 WKS-NOMBRE PIC X(20).
               10 WKS-PRIMER-APELLIDO PIC X(20).
               10 WKS-SEGUNDO-APELLIDO PIC X(20).
           05 WKS-FECHA-NAC.
               10 WKS-ANIO PIC 9(4).
               10 WKS-MES PIC 9(2).
               10 WKS-DIA PIC 9(2).
           05 WKS-SEXO PIC X(1).
           05 WKS-DOMICILIO PIC X(30).
           05 WKS-TELEFONO PIC 9(10).
           05 WKS-RFC PIC X(13).
           05 WKS-NSS PIC 9(11).
           05 WKS-SIN-USO PIC X(100).

       01 WKS-CAL-FECHA-NAC PIC 9(8).
       01 WKS-CAL-FECHA-HOY PIC 9(8).
       01 WKS-CAL-DIAS PIC 9(5).
       01 WKS-CAL-ANIOS PIC 9(2).

       01 WKS-FECHA-HOY-COMP.
           05 WKS-FH-ANIO PIC 9(4).
           05 WKS-FH-MES PIC 9(2).
           05 WKS-FH-DIA PIC 9(2).
           05 WKS-FH-HORA PIC 9(2).
           05 WKS-FH-MIN PIC 9(2).
           05 WKS-FH-SEG PIC 9(2).
           05 WKS-FH-MS PIC 9(2).
           05 WKS-FH-GMT PIC S9(4).

       01 WKS-FIN PIC 9(1) VALUE 0.
       01 WKS-INDICADOR PIC 9(1).
       01 FS-STATUS PIC 9(2).

       PROCEDURE DIVISION.
      *-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-
       MAIN-PROCEDURE.
           PERFORM ABRIR-ARCHIVO.
           PERFORM ELEGIR-OPCION UNTIL WKS-FIN = 1.
           PERFORM CERRAR-ARCHIVO.

       STOP RUN.

       ABRIR-ARCHIVO.
       MOVE ZERO TO FS-STATUS.
       OPEN I-O ARCHIVO-EMPLEADOS.
       IF FS-STATUS = 35
           OPEN OUTPUT ARCHIVO-EMPLEADOS
       ELSE
           NEXT SENTENCE.

       ELEGIR-OPCION.
       DISPLAY "*****MENÚ*****"
       DISPLAY "INGRESE UNA DE LAS SIGUIENTES OPCIONES:".
       DISPLAY "A: ALTAS".
       DISPLAY "I: IMPRIMIR".
       DISPLAY "M: MODIFICAR".
       DISPLAY "E: ELIMINAR".
       DISPLAY "S: SALIR".
       ACCEPT OPCION.

       EVALUATE TRUE
       WHEN OPCION = "A"
           PERFORM ALTAS
           PERFORM ELEGIR-OPCION
       WHEN OPCION = "I"
           PERFORM IMPRIMIR
           PERFORM ELEGIR-OPCION
       WHEN OPCION = "M"
           PERFORM MODIFICAR
           PERFORM ELEGIR-OPCION
       WHEN OPCION = "E"
           PERFORM ELIMINAR
           PERFORM ELEGIR-OPCION
       WHEN OPCION = "S"
           DISPLAY "PROGRAMA FINALIZADO"
           PERFORM CERRAR-ARCHIVO
           MOVE 1 TO WKS-FIN
       WHEN OTHER
           DISPLAY "OPCIÓN INVÁLIDA"
           PERFORM ELEGIR-OPCION
       END-EVALUATE.

       ALTAS.
       DISPLAY "*****ALTA DE EMPLEADOS*****"
       PERFORM INGRESAR-DATOS.
       PERFORM VALIDAR-DATOS.
       PERFORM CALCULAR-EDAD.
       PERFORM GUARDAR-DATOS.
       DISPLAY "ALTA EXITOSA".

       INGRESAR-DATOS.
       DISPLAY "INGRESE LOS DATOS DEL EMPLEADO: ".
       ACCEPT ENTRADA-EMPLEADO.
       UNSTRING ENTRADA-EMPLEADO DELIMITED BY ','
       INTO WKS-NUM-EMP
            WKS-NOMBRE
            WKS-PRIMER-APELLIDO
            WKS-SEGUNDO-APELLIDO
            WKS-ANIO
            WKS-MES
            WKS-DIA
            WKS-SEXO
            WKS-DOMICILIO
            WKS-TELEFONO
            WKS-RFC
            WKS-NSS
            WKS-SIN-USO.

       VALIDAR-DATOS.
       IF WKS-NUM-EMP = 0
           DISPLAY "NÚMERO DE EMPLEADO NO PUEDE ESTAR VACÍO, VERIFIQUE"
           PERFORM INGRESAR-DATOS
       ELSE IF WKS-NOMBRE = SPACES
           DISPLAY "NOMBRE DEL EMPLEADO NO PUEDE ESTAR VACÍO, VERIFIQUE"
           PERFORM INGRESAR-DATOS
       ELSE IF WKS-PRIMER-APELLIDO = SPACES
           DISPLAY "PRIMER APELLIDO NO PUEDE ESTAR VACÍO, VERIFIQUE"
           PERFORM INGRESAR-DATOS
       ELSE IF WKS-SEGUNDO-APELLIDO = SPACES
           DISPLAY "SEGUNDO APELLIDO NO PUEDE ESTAR VACÍO, VERIFIQUE"
           PERFORM INGRESAR-DATOS
       ELSE IF WKS-DIA = 0
           DISPLAY "DIA DE NACIMIENTO NO PUEDE ESTAR VACÍO, VERIFIQUE"
           PERFORM INGRESAR-DATOS
       ELSE IF WKS-MES = 0
           DISPLAY "MES DE NACIMIENTO NO PUEDE ESTAR VACÍO, VERIFIQUE"
           PERFORM INGRESAR-DATOS
       ELSE IF WKS-ANIO = 0
           DISPLAY "AÑO DE NACIMIENTO NO PUEDE ESTAR VACÍO, VERIFIQUE"
           PERFORM INGRESAR-DATOS
       ELSE IF WKS-SEXO = SPACES
           DISPLAY "SEXO NO PUEDE ESTAR VACÍO, VERIFIQUE"
           PERFORM INGRESAR-DATOS
       ELSE IF WKS-DOMICILIO = SPACES
           DISPLAY "DOMICILIO NO PUEDE ESTAR VACÍO, VERIFIQUE"
           PERFORM INGRESAR-DATOS
       ELSE IF WKS-TELEFONO = 0
           DISPLAY "TELEFONO NO PUEDE ESTAR VACÍO, VERIFIQUE"
           PERFORM INGRESAR-DATOS
       ELSE IF WKS-RFC = SPACES
           DISPLAY "RFC NO PUEDE ESTAR VACÍO, VERIFIQUE"
           PERFORM INGRESAR-DATOS
       ELSE IF WKS-NSS = 0
           DISPLAY "NSS NO PUEDE ESTAR VACÍO, VERIFIQUE"
           PERFORM INGRESAR-DATOS
       ELSE
           NEXT SENTENCE.

       CALCULAR-EDAD.
       STRING WKS-ANIO, WKS-MES, WKS-DIA INTO WKS-CAL-FECHA-NAC.
       MOVE FUNCTION CURRENT-DATE TO WKS-FECHA-HOY-COMP.
       STRING WKS-FH-ANIO, WKS-FH-MES, WKS-FH-DIA
       INTO WKS-CAL-FECHA-HOY.
       COMPUTE WKS-CAL-DIAS =
       FUNCTION INTEGER-OF-DATE(WKS-CAL-FECHA-HOY) -
       FUNCTION INTEGER-OF-DATE(WKS-CAL-FECHA-NAC).
       COMPUTE WKS-CAL-ANIOS = WKS-CAL-DIAS / 365.

       GUARDAR-DATOS.
       MOVE WKS-NUM-EMP TO REG-NUMERO-EMPLEADO.
       MOVE WKS-NOMBRE-COMP TO REG-NOMBRE-EMPLEADO.
       MOVE WKS-CAL-ANIOS TO REG-EDAD.
       MOVE WKS-SEXO TO REG-SEXO.
       MOVE WKS-DOMICILIO TO REG-DOMICILIO.
       MOVE WKS-TELEFONO TO REG-TELEFONO.
       MOVE WKS-RFC TO REG-RFC.
       MOVE WKS-NSS TO REG-NSS.
       WRITE REGISTRO-EMPLEADOS
           INVALID KEY
               DISPLAY "NUMERO DE EMPLEADO DUPLICADO, VERIFIQUE"
               PERFORM INGRESAR-DATOS
           NOT INVALID KEY
               PERFORM LIMPIAR-REGISTRO
               NEXT SENTENCE.

       IMPRIMIR.
       DISPLAY "*****IMPRESION*****"
       DISPLAY "INGRESE EL NUMERO DEL EMPLEADO QUE DESEA IMPRIMIR: ".
       ACCEPT WKS-NUM-EMP.
       PERFORM BUSCAR.
       PERFORM MOSTRAR-DATOS.

       BUSCAR.
       MOVE ZERO TO WKS-INDICADOR.

       IF WKS-NUM-EMP = 0
           DISPLAY "NÚMERO DE EMPLEADO NO PUEDE ESTAR VACÍO, VERIFIQUE"
           PERFORM IMPRIMIR
       ELSE
       MOVE WKS-NUM-EMP TO REG-NUMERO-EMPLEADO
       READ ARCHIVO-EMPLEADOS RECORD KEY REG-NUMERO-EMPLEADO
           INVALID KEY
               MOVE 1 TO WKS-INDICADOR
               PERFORM LIMPIAR-REGISTRO
               DISPLAY "EL NUMERO DE EMPLEADO " WKS-NUM-EMP " NO EXISTE"
               PERFORM ELEGIR-OPCION
           NOT INVALID KEY
               MOVE 0 TO WKS-INDICADOR
               NEXT SENTENCE.

       LIMPIAR-REGISTRO.
       MOVE ZEROS TO REG-NUMERO-EMPLEADO.
       MOVE SPACES TO REG-NOMBRE-EMPLEADO.
       MOVE ZEROS TO REG-EDAD.
       MOVE SPACES TO REG-SEXO.
       MOVE SPACES TO REG-DOMICILIO.
       MOVE ZEROS TO REG-TELEFONO.
       MOVE SPACES TO REG-RFC.
       MOVE ZEROS TO REG-NSS.

       MOSTRAR-DATOS.
       DISPLAY "           0         0         0         0         "
       "0         0         0         0         0         1        "
       "1         1         1         1         1         1"
       DISPLAY "           1         2         3         4         "
       "5         6         7         8         9         0        "
       "1         2         3         4         5         6"
       DISPLAY "  1234567890123456789012345678901234567890123456789"
       "01234567890123456789012345678901234567890123456789012345678"
       "90123456789012345678901234567890123456789012345678901234"
       DISPLAY "1 NUMERO DE EMPLEADO  NOMBRE DEL EMPLEADO          "
       "                                 EDAD  SEXO  DOMICILIO     "
       "                  TELEFONO    RFC            NSS"
       DISPLAY "2 ------------------  -----------------------------"
       "-------------------------------  ----  ----  --------------"
       "----------------  ----------  -------------  -----------"
       DISPLAY "3 " REG-NUMERO-EMPLEADO
               "            " REG-NOMBRE-EMPLEADO
               "  " REG-EDAD
               "     " REG-SEXO
               "    " REG-DOMICILIO
               "  " REG-TELEFONO
               "  " REG-RFC
               "  " REG-NSS.

       MODIFICAR.
       DISPLAY "*****MODIFICACIÓN DE REGISTROS*****"
       PERFORM ELEGIR-MODIFICACION.

       ELEGIR-MODIFICACION.
       DISPLAY "ELIJA EL TIPO DE MODIFICACIÓN QUE DESEA REALIZAR: ".
       DISPLAY "C: ACTUALIZAR CAMPOS NO LLAVE".
       DISPLAY "L: ACTUALIZAR TODO EL REGISTRO INCLUIDO EL CAMPO LLAVE".
       ACCEPT OPCION-MOD.
       EVALUATE TRUE
       WHEN OPCION-MOD = "C"
           PERFORM MOD-PARCIAL
       WHEN OPCION-MOD = "L"
           PERFORM MOD-COMPLETA
       WHEN OTHER
           DISPLAY "OPCIÓN INVÁLIDA PARA MODIFICAR "
           PERFORM ELEGIR-MODIFICACION
       END-EVALUATE.

       MOD-PARCIAL.
       DISPLAY "*****MODIFICACIÓN PARCIAL*****"
       DISPLAY "INGRESE EL NUMERO DEL EMPLEADO QUE DESEA MODIFICAR: ".
       ACCEPT WKS-NUM-EMP.
       PERFORM BUSCAR.
       PERFORM INGRESAR-DATOS-SIN-NUM-EMP.
       PERFORM VALIDAR-DATOS-SIN-NUM-EMP.
       PERFORM CALCULAR-EDAD.
       PERFORM ACTUALIZAR-DATOS-SIN-NUM-EMP.
       DISPLAY "ACTUALIZACIÓN EXITOSA DEL EMPLEADO NUMERO " WKS-NUM-EMP.

       INGRESAR-DATOS-SIN-NUM-EMP.
       DISPLAY "INGRESE LOS DATOS DEL EMPLEADO: ".
       ACCEPT ENTRADA-EMPLEADO.
       UNSTRING ENTRADA-EMPLEADO DELIMITED BY ','
       INTO WKS-NOMBRE
            WKS-PRIMER-APELLIDO
            WKS-SEGUNDO-APELLIDO
            WKS-ANIO
            WKS-MES
            WKS-DIA
            WKS-SEXO
            WKS-DOMICILIO
            WKS-TELEFONO
            WKS-RFC
            WKS-NSS
            WKS-SIN-USO.

       VALIDAR-DATOS-SIN-NUM-EMP.
       IF WKS-NOMBRE = SPACES
           DISPLAY "NOMBRE DEL EMPLEADO NO PUEDE ESTAR VACÍO, VERIFIQUE"
           PERFORM MOD-PARCIAL
       ELSE IF WKS-PRIMER-APELLIDO = SPACES
           DISPLAY "PRIMER APELLIDO NO PUEDE ESTAR VACÍO, VERIFIQUE"
           PERFORM MOD-PARCIAL
       ELSE IF WKS-SEGUNDO-APELLIDO = SPACES
           DISPLAY "SEGUNDO APELLIDO NO PUEDE ESTAR VACÍO, VERIFIQUE"
           PERFORM MOD-PARCIAL
       ELSE IF WKS-DIA = 0
           DISPLAY "DIA DE NACIMIENTO NO PUEDE ESTAR VACÍO, VERIFIQUE"
           PERFORM MOD-PARCIAL
       ELSE IF WKS-MES = 0
           DISPLAY "MES DE NACIMIENTO NO PUEDE ESTAR VACÍO, VERIFIQUE"
           PERFORM MOD-PARCIAL
       ELSE IF WKS-ANIO = 0
           DISPLAY "AÑO DE NACIMIENTO NO PUEDE ESTAR VACÍO, VERIFIQUE"
           PERFORM MOD-PARCIAL
       ELSE IF WKS-SEXO = SPACES
           DISPLAY "SEXO NO PUEDE ESTAR VACÍO, VERIFIQUE"
           PERFORM MOD-PARCIAL
       ELSE IF WKS-DOMICILIO = SPACES
           DISPLAY "DOMICILIO NO PUEDE ESTAR VACÍO, VERIFIQUE"
           PERFORM MOD-PARCIAL
       ELSE IF WKS-TELEFONO = 0
           DISPLAY "TELEFONO NO PUEDE ESTAR VACÍO, VERIFIQUE"
           PERFORM MOD-PARCIAL
       ELSE IF WKS-RFC = SPACES
           DISPLAY "RFC NO PUEDE ESTAR VACÍO, VERIFIQUE"
           PERFORM MOD-PARCIAL
       ELSE IF WKS-NSS = 0
           DISPLAY "NSS NO PUEDE ESTAR VACÍO, VERIFIQUE"
           PERFORM MOD-PARCIAL
       ELSE
           NEXT SENTENCE.

       ACTUALIZAR-DATOS-SIN-NUM-EMP.
       MOVE WKS-NOMBRE-COMP TO REG-NOMBRE-EMPLEADO.
       MOVE WKS-CAL-ANIOS TO REG-EDAD.
       MOVE WKS-SEXO TO REG-SEXO.
       MOVE WKS-DOMICILIO TO REG-DOMICILIO.
       MOVE WKS-TELEFONO TO REG-TELEFONO.
       MOVE WKS-RFC TO REG-RFC.
       MOVE WKS-NSS TO REG-NSS.
       REWRITE REGISTRO-EMPLEADOS
           INVALID KEY
               DISPLAY "ERROR AL ACTUALIZAR EL REGISTRO, VERIFIQUE"
               PERFORM MOD-PARCIAL
           NOT INVALID KEY
               NEXT SENTENCE.

       MOD-COMPLETA.
       DISPLAY "*****MODIFICACIÓN COMPLETA*****"
       DISPLAY "INGRESE EL NUMERO DEL EMPLEADO QUE DESEA MODIFICAR: ".
       ACCEPT WKS-NUM-EMP.
       PERFORM BUSCAR.
       PERFORM CONFIRMAR-ELIMINACION.
       PERFORM INGRESAR-DATOS.
       PERFORM VALIDAR-DATOS.
       PERFORM CALCULAR-EDAD.
       PERFORM GUARDAR-DATOS.
       DISPLAY "ACTUALIZACIÓN EXITOSA DEL EMPLEADO NUMERO " WKS-NUM-EMP.

       BORRAR-REGISTRO.
       DELETE ARCHIVO-EMPLEADOS
           INVALID KEY
                DISPLAY "ERROR AL ELIMINAR EL REGISTRO."
                PERFORM ELEGIR-OPCION
            NOT INVALID KEY
                DISPLAY "ELIMINACIÓN EXITOSA DEL EMPLEADO NUMERO: "
                WKS-NUM-EMP.

       ELIMINAR.
       DISPLAY "*****ELIMINACIÓN DE REGISTROS*****"
       DISPLAY "INGRESE EL NUMERO DEL EMPLEADO QUE DESEA ELIMINAR: ".
       ACCEPT WKS-NUM-EMP.
       PERFORM BUSCAR.
       PERFORM CONFIRMAR-ELIMINACION.

       CONFIRMAR-ELIMINACION.
       DISPLAY "SEGURO QUE ELIMINAR EL REGISTRO DEL EMPLEADO: "
       WKS-NUM-EMP " ? S-SI / N-NO".
       ACCEPT CONFIRMACION-ELIMINAR.
       IF CONFIRMACION-ELIMINAR = "S"
           PERFORM BORRAR-REGISTRO
       ELSE IF CONFIRMACION-ELIMINAR = "N"
           DISPLAY "ELIMINACIÓN CANCELADA"
           PERFORM ELEGIR-OPCION
       ELSE
           DISPLAY "OPCIÓN INVÁLIDA"
           PERFORM CONFIRMAR-ELIMINACION.

       CERRAR-ARCHIVO.
       CLOSE ARCHIVO-EMPLEADOS.

       STOP RUN.

       END PROGRAM EMPLEADOS.
